Revit 2027 API
FabricationPart.ValidationStatus Property
 The validation status of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ValidationStatus ValidationStatus { get; }
Public ReadOnly Property ValidationStatus As ValidationStatus
	Get
public:
property ValidationStatus ValidationStatus {
	ValidationStatus get ();
}
member ValidationStatus : ValidationStatus with get
Property Value
ValidationStatus
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace